src_ext/Documents/УЗ_ПереводУченика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПереводУченика</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_ГруппыОбучения</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УЗ_СоставГрупп</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
					<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИз</Name>
					<Type>
					<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВ</Name>
					<Type>
					<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>150</v8:Length>
					</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
					<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>255</v8:Length>
					</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
							<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_СоставГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_СоставГрупп</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Состоит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_ПереводУченика/Ext/ObjectModule.bsl
//Перевод ученика (В29): зачисление в группу, перевод из группы в группу, выбытие из группы с даты документа — как
//кадровый перевод в типовых. Логика — модуль менеджера (Документы.УЗ_ПереводУченика.ПланПеревода): план изменений
//уроков-планов, проверки целиком, затем запись состава групп и перестроение планов.

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//дата запрета проверяется подпиской УЗ_ДатаЗапретаПередЗаписью (модуль УЗ_ДатыЗапрета)
	УЗ_Общий.ЗаполнитьАвтораИОрганизацию(ЭтотОбъект);
	//записи документа до перепроведения и отмены: автоудаление движений стирает их раньше обработки проведения, а
	//план перевода считает разницу «было / станет»
	Если Не ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("УЗ_ПрежниеЗаписи", Документы.УЗ_ПереводУченика.ЗаписиДокумента(Ссылка));
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Документы.УЗ_ПереводУченика.Провести(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Документы.УЗ_ПереводУченика.ОтменитьПроведение(ЭтотОбъект, Отказ);
КонецПроцедуры

//Ввод на основании: из карточки ученика — ученик и его группа на сегодня (если она одна) как «Из группы»; из группы —
//«Из группы» (учеников подбирают кнопкой «Заполнить из группы»).
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ЭтоНовый() И Не ЗначениеЗаполнено(Организация) Тогда
		Организация = РегистрыСведений.УЗ_Настройки.Настройки().Организация;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УЗ_ФизЛица") И ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Ученики.Добавить().Ученик = ДанныеЗаполнения;
		Текущие = РегистрыСведений.УЗ_СоставГрупп.ГруппыУченика(ДанныеЗаполнения).НайтиСтроки(
			Новый Структура("ДатаОкончания", '00010101'));
		Если Текущие.Количество() = 1 Тогда
			ГруппаИз = Текущие[0].ГруппаОбучения;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УЗ_ГруппыОбучения")
		И ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ГруппаИз = ДанныеЗаполнения;
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	АвторДокумента = Неопределено;
	Комментарий    = Неопределено;
КонецПроцедуры
